Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData
Analysis change management part bar data.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.PartId
Part identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.TimeId
Time identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.Index
Item Index.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.IsLastIndex
Is last index (returned).

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.PhysicalCoordSys
The physical coordinate system.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.PhysicalProfile
The physical profile.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.PhysicalMaterial
The physical material.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.AnalysisCoordSys
The analysis coordinate system.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.AnalysisProfile
The analysis profile.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData.AnalysisMaterial
The analysis material.